{
   "news": [
        {
           "header": "LCubed AB awarded Vinnova innovative startups contribution",
           "date": "14 June 2018",
           "type": "Press Release",
           "content": "LCubed AB is delighted to announce that it has been granted a 300,000 SEK contribution from Vinnova, the Swedish Governmental Agency for Innovation Systems, as part of its spring 2018 Innovative Startups Stage 1 call. LCubed AB was one of 92 start-up companies with innovative business ideas, selected from over 400 applications, to share 27 million SEK from Vinnova in this call. These companies have received funding to develop innovative solutions that can reach the market and contribute to Sweden's development and competitiveness.</p><p>The purpose of the award to LCubed AB is to support the company in its goal to address the relationship between companies, government agencies and other organisations and the people they interact with. The collection, storage and use of data, much of which is personal, constitute the heart of the digital economy. In the context of the EU’s General Data Protection Regulation (GDPR), a prerequisite for the success of the digital economy is that companies obtain consent to the use and storage of this personal information.</p><p>iGrant.io is LCubed AB’s cloud-based service for the transmission of personal data and consent that creates transparency and confidence in the digital economy. In addition to lowering costs for regulatory compliance, such as GDPR, companies use iGrant.io to manage customer consent in a way that inspires confidence and brand loyalty.</p><p>The iGrant.io project consists of three parallel flows;<br>&nbsp;&nbsp;<i class='ion-arrow-right-b'></i>&nbsp;Beta testing and construction of a support and monitoring organization, the launch and test of a beta version of the platform, app and the development of a test and support environment<br>&nbsp;&nbsp;<i class='ion-arrow-right-b'></i>&nbsp;Market validation through the creation of test market messages, pricing and a business model aimed at both customers as well as partners<br>&nbsp;<i class='ion-arrow-right-b'></i>&nbsp;&nbsp;Protection of intellectual property rights including any patent applications</p><p>LCubed AB co-founder Lal Chandran says: 'For a start-up company like LCubed AB, the supportive and transparent role that Vinnova plays in encouraging innovation in Sweden cannot be emphasised enough. Vinnova has been essential in helping our company establish the groundwork for growth that would unfortunately have been overlooked without their valuable and timely contribution.'</p><p>LCubed AB expects to launch iGrant.io for both companies and users in the Swedish market during the course of 2018. The iGrant.io project will run until December 2018.</p><br><h5>About LCubed AB</h5><p>LCubed AB is a Swedish company based in Stockholm. To learn more about Vinnova, go to <a href='https://vinnova.se/en/'>vinnova.se</a>.</p><p></p><p>For marketing & media queries:<br>David Goodman, LCubed AB<br>t: +44 7866 360 800<br>e: david@igrant.io"
        },
		    {
           "header": "iGrant.io whitepaper explores user engagement to enhance consumer trust",
           "date": "13 June 2018",
           "type": "Whitepaper Release",
           "content": "The whitepaper looks at how organisations can avoid falling foul of the authorities, as well as their customer base, by embracing the opportunities presented by the new data protection regulations, particularly the EU's GDPR. It argues that, despite the apparent negative trends and perceptions, the high visibility of data protection and privacy issues in the public eye today provides a springboard for companies to demonstrate their understanding of the underlying principles of the new sets of legislation. Earning their customers' trust and consent also enables companies to leverage greater value from the personal data they have access to."
        } 
     
   ]
}