{
   "news": [
        {
           "header": "iGrant.io releases simplified consumer guide to personal data and GDPR",
           "date": "27 Dec 2018",
           "type": "Paper Release",
           "pprid": "iGrant.io_SimplifiedConsumerGuide_to_GDPR.pdf", 
           "content": "This document is aimed at anyone and everyone who has felt a sense of dread when receiving yet another email about the GDPR and isn’t entirely sure what it all means.  iGrant.io’s ‘Simplified Guide to Personal Data and the GDPR’ is intended to get to the essence of the new regulation on data protection and privacy that was introduced in all EU Member States at the end of May 2018 and in so doing to de-mystify much of its language and jargon. By highlighting the fundamental right of respect that we all, as citizens, are entitled to, this short document illustrates how information pertaining to our personal lifestyles as well as those of our families and friends is often held and even re-used by companies large and small, deliberately or otherwise, without our knowing.</p><br> <p>The message is clear: there really is nothing to be afraid of that a little application and the right tools, such as the iGrant.io mobile app, cannot put right. Meaning that, by taking control of what information is being held about us and what it’s being used for, we can both protect our data from any form of misuse and establish a more transparent and trustworthy relationship with the companies and organisations we do business and transact with. Nothing to worry about any more!"
        },

          {
           "header": "iGrant.io approved for Swedish hotspot at Slush 2018 in Helsinki",
           "date": "26 Nov 2018",
           "type": "Press Release",
           "content": "LCubed AB is delighted to announce that iGrant.io, its cloud-based personal data and consent mediation platform, has been chosen to participate in Business Sweden’s Premium Program at Slush 2018 in Helsinki on 4-5 December. As part of this year’s edition of Swedish Hotspot, thirty selected companies will join an expected 2,600 start-ups and 1,600 investors at one of the industry’s top events for developing new business relationships. <br><br>LCubed AB co-founder and CEO Lotta Lundin says: “We are really thrilled to have been chosen to feature in this prestigious Swedish program. Slush is such an invaluable global event, enabling start-up companies like iGrant.io to forge links with potential investors and partners to get our stories out through the media. After the success of Web Summit 2018, we relish the opportunity to demonstrate again the value that iGrant.io brings to businesses and individuals, in building and maintaining data sharing relationships based on trust and transparency. Helsinki promises to be very exciting for iGrant.io!”<br><br><h5>About LCubed AB</h5></p>LCubed AB is a Swedish company founded in 2017 and based in Stockholm. It develops and markets iGrant.io, a cloud-based personal data and consent mediation platform that enables a fully transparent and trustworthy data sharing economy. It is used by organisations, both private and public, to unlock the value of personal data in a fully compliant manner and to give individuals control to easily determine how their data is used. Apart from lowering the cost of legal compliance to data protection regulations, such as the GDPR, iGrant.io provides companies with a flexible solution to both establish and maintain trust with their customers based on transparency and respect in how personal data is used.</p><p></p><p>For more information, please visit iGrant.io and @iGrant.io as well as #consent, #GDPR, #GDPRCompliance, #dataRegulation, #RegTech, #personalData <br><p></p><p>To learn more about Slush 2018, go to <a href='https://www.slush.org/'>slush.org</a>.</p><p>For marketing & media queries:<br>David Goodman,<br>LCubed AB, Sweden<br>t: +44 7866 360 800<br>e: david@igrant.io"
        },

         {
           "header": "iGrant.io publishes whitepaper aimed at data protection officers",
           "date": "28 Sep 2018",
           "type": "Whitepaper Release",
           "wpid": "30b5c0842e", 
           "content": "The whitepaper observes the DPO’s conundrum in having to maintain a balance between protecting corporate interests and customer (regulatory) rights. Prioritising a company’s interest over consumer rights is no longer a viable approach: the only corporate strategy that resonates today is one that both respects consumer rights and provides a competitive advantage. The key is to build a long term trust relationship with customers that is predicated on keeping them informed through transparency and an ongoing dialogue.</p><br><p>To achieve that goal, the paper outlines the benefits of taking a pro-active approach to data sharing that can be greatly enhanced by deploying iGrant.io’s cloud-based consent management platform and engaging with customers through the iGrant.io mobile app/portal/APIs or through organisation mobile app/portals."
        },

        {
           "header": "LCubed AB selected to showcase iGrant.io at Web Summit 2018",
           "date": "16 Aug 2018",
           "type": "Press Release",
           "content": "LCubed AB is proud to announce that it has been selected to participate in the 2018 Web Summit ALPHA programme in Lisbon, November 5-8, 2018. Web Summit 2018 expects to host more than 20,000 companies and is a premiere opportunity to gain exposure to some of the world’s top investors, media and business leaders. <br><br>LCubed AB co-founder Lal Chandran says: “We are absolutely delighted to be one of the Internet companies chosen to showcase our solution at such a prestigious event. For all startups, the role Web Summit plays in forging significant relationships between startups, investors, and others is very exciting. For us, it is an invaluable opportunity to show how iGrant.io enables trust and transparency between businesses and their customers, bringing a unique value to the data economy. We are really looking forward to coming to Lisbon!”<br><br><h5>About LCubed AB</h5></p>LCubed AB is a Swedish company founded in 2017 and based in Stockholm. It develops and markets iGrant.io, a cloud-based personal data and consent mediation platform that enables a fully transparent and trustworthy data sharing economy. It supports organisations, both private and public, to unlock the value of personal data in a fully compliant manner and to give individuals control to easily determine how their data is used. Apart from lowering the cost of legal compliance to data protection regulations, such as the GDPR, iGrant.io provides companies with a flexible solution to both establish and maintain trust with their customers based on transparency and respect in how personal data is used.</p><p></p><p>For more information, please visit iGrant.io and @iGrant.io as well as #consent, #GDPR, #GDPRCompliance, #dataRegulation, #RegTech, #personalData <br><p></p><p>For investor queries:<br>Lotta Lundin, Co-Founder, LCubed AB, Sweden<br>T: +46 730 371 100<br>E: lotta@igrant.io<p><p>For marketing & media queries:<br>David Goodman, Chief Evangelist, LCubed AB, Sweden<br>T: +44 7866 360 800<br>E: david@igrant.io"
        },

        {
           "header": "LCubed AB awarded Vinnova innovative startups contribution",
           "date": "15 Jun 2018",
           "type": "Press Release",
           "content": "LCubed AB is delighted to announce that it has been granted a 300,000 SEK contribution from Vinnova, the Swedish Governmental Agency for Innovation Systems, as part of its spring 2018 Innovative Startups Stage 1 call. LCubed AB was one of 92 start-up companies with innovative business ideas, selected from over 400 applications, to share 27 million SEK from Vinnova in this call. These companies have received funding to develop innovative solutions that can reach the market and contribute to Sweden's development and competitiveness.</p><p>The purpose of the award to LCubed AB is to support the company in its goal to address the relationship between companies, government agencies and other organisations and the people they interact with. The collection, storage and use of data, much of which is personal, constitute the heart of the digital economy. In the context of the EU’s General Data Protection Regulation (GDPR), a prerequisite for the success of the digital economy is that companies obtain consent to the use and storage of this personal information.</p><p>iGrant.io is LCubed AB’s cloud-based service for the transmission of personal data and consent that creates transparency and confidence in the digital economy. In addition to lowering costs for regulatory compliance, such as GDPR, companies use iGrant.io to manage customer consent in a way that inspires confidence and brand loyalty.</p><p>The iGrant.io project consists of three parallel flows;<br>&nbsp;&nbsp;<i class='ion-arrow-right-b'></i>&nbsp;Beta testing and construction of a support and monitoring organization, the launch and test of a beta version of the platform, app and the development of a test and support environment<br>&nbsp;&nbsp;<i class='ion-arrow-right-b'></i>&nbsp;Market validation through the creation of test market messages, pricing and a business model aimed at both customers as well as partners<br>&nbsp;<i class='ion-arrow-right-b'></i>&nbsp;&nbsp;Protection of intellectual property rights including any patent applications</p><p>LCubed AB co-founder Lal Chandran says: 'For a start-up company like LCubed AB, the supportive and transparent role that Vinnova plays in encouraging innovation in Sweden cannot be emphasised enough. Vinnova has been essential in helping our company establish the groundwork for growth that would unfortunately have been overlooked without their valuable and timely contribution.'</p><p>LCubed AB expects to launch iGrant.io for both companies and users in the Swedish market during the course of 2018. The iGrant.io project will run until December 2018.</p><br><h5>About LCubed AB</h5><p>LCubed AB is a Swedish company based in Stockholm. To learn more about Vinnova, go to <a href='https://vinnova.se/en/'>vinnova.se</a>.</p><p></p><p>For marketing & media queries:<br>David Goodman, LCubed AB<br>t: +44 7866 360 800<br>e: david@igrant.io"
        },
		    {
           "header": "iGrant.io whitepaper explores user engagement to enhance consumer trust",
           "date": "13 Jun 2018",
           "type": "Whitepaper Release",
	   "wpid": "b05877e763", 
           "content": "The whitepaper looks at how organisations can avoid falling foul of the authorities, as well as their customer base, by embracing the opportunities presented by the new data protection regulations, particularly the EU's GDPR. It argues that, despite the apparent negative trends and perceptions, the high visibility of data protection and privacy issues in the public eye today provides a springboard for companies to demonstrate their understanding of the underlying principles of the new sets of legislation. Earning their customers' trust and consent also enables companies to leverage greater value from the personal data they have access to."
        } 
     
   ]
}